docroot/sites/all/modules/commerce_cardsave/xml/cross.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<CrossReferenceTransaction xmlns="https://www.thepaymentgateway.net/">
<PaymentMessage>
<MerchantAuthentication MerchantID="@merchant_id" Password="@password" />
<TransactionDetails Amount="@amount" CurrencyCode="@currency_code">
<MessageDetails TransactionType="@type" NewTransaction="@new" CrossReference="@cross_refernce" />
<OrderID>@order_id</OrderID>
<OrderDescription>@description</OrderDescription>
<TransactionControl>
<EchoCardType>TRUE</EchoCardType>
<EchoAVSCheckResult>TRUE</EchoAVSCheckResult>
<EchoCV2CheckResult>TRUE</EchoCV2CheckResult>
<EchoAmountReceived>TRUE</EchoAmountReceived>
<DuplicateDelay>60</DuplicateDelay>
<AVSOverridePolicy>BPPF</AVSOverridePolicy>
<ThreeDSecureOverridePolicy>FALSE</ThreeDSecureOverridePolicy>
</TransactionControl>
</TransactionDetails>
<CustomerDetails>
<CustomerIPAddress>@ip</CustomerIPAddress>
</CustomerDetails>
</PaymentMessage>
</CrossReferenceTransaction>
</soap:Body>
</soap:Envelope>